local ADDON_NAME, TeleportAnnouncer = ...

local L = TeleportAnnouncer.Locale

TeleportAnnouncer.teleportSpells = {
    --至暗之夜
    [1254572] = {keystone = true},
    [1254559] = {keystone = true},
    [1254563] = {keystone = true},
    [1254400] = {keystone = true},
    [1254555] = {keystone = true},
    [1254551] = {keystone = true},
    [1254557] = {keystone = true},

    --地心之战
    [445417] = {keystone = true},
    [445440] = {keystone = true},
    [445416] = {keystone = true},
    [445441] = {keystone = true},
    [445414] = {keystone = true},
    [1216786] = {keystone = true},
    [445444] = {keystone = true},
    [445443] = {keystone = true},
    [445269] = {keystone = true},
    [1237215] = {keystone = true},

    --巨龙时代
    [393273] = {keystone = true},
    [393279] = {keystone = true},
    [393267] = {keystone = true},
    [393283] = {keystone = true},
    [393276] = {keystone = true},
    [393262] = {keystone = true},
    [393256] = {keystone = true},
    [393222] = {keystone = true},
    [424197] = {keystone = true},

    --暗影国度
    [354468] = {keystone = true},
    [354465] = {keystone = true},
    [354464] = {keystone = true},
    [354462] = {keystone = true},
    [354463] = {keystone = true},
    [354469] = {keystone = true},
    [354466] = {keystone = true},
    [354467] = {keystone = true},
    [367416] = {keystone = true},

    --争霸艾泽拉斯
    [424187] = {keystone = true},
    [410071] = {keystone = true},
    [373274] = {keystone = true},
    [467555] = {keystone = true},
    [467553] = {keystone = true},
    [464256] = {keystone = true},
    [445418] = {keystone = true},
    [410074] = {keystone = true},
    [424167] = {keystone = true},

    --军团再临
    [424153] = {keystone = true},
    [393766] = {keystone = true},
    [424163] = {keystone = true},
    [393764] = {keystone = true},
    [373262] = {keystone = true},
    [410078] = {keystone = true},

    --德拉诺之王
    [159897] = {keystone = true},
    [159895] = {keystone = true},
    [159901] = {keystone = true},
    [159900] = {keystone = true},
    [159896] = {keystone = true},
    [159899] = {keystone = true},
    [159898] = {keystone = true},
    [159902] = {keystone = true},

    --熊猫人之谜
    [131225] = {keystone = true},
    [131222] = {keystone = true},
    [131232] = {keystone = true},
    [131231] = {keystone = true},
    [131229] = {keystone = true},
    [131228] = {keystone = true},
    [131206] = {keystone = true},
    [131205] = {keystone = true},
    [131204] = {keystone = true},

    --大地的裂变
    [445424] = {keystone = true},
    [424142] = {keystone = true},
    [410080] = {keystone = true},

    --团本传送
    [373190] = {},
    [373191] = {},
    [373192] = {},
    [432254] = {},
    [432257] = {},
    [432258] = {},
    [1226482] = {},
    [1239155] = {},

    --道具
    [396591] = {item = 202046}, --始祖龟幸运符
    [189838] = {item = 128353}, --海军上将的罗盘
    [253937] = {}, --飞行管理员的哨子 / G.E.A.R.追踪道标
    [171253] = {item = 110560, heartstone = true}, --要塞炉石
    [222695] = {item = 140192, heartstone = true}, --达拉然炉石
    [325624] = {}, --位移符文
    [49844] = {item = 37863}, --烈酒的遥控器
    [254667] = {item = 153226}, --观察者之地共鸣器
    [346170] = {item = 184503}, --侍神者的袖珍传送门：炽蓝仙野
    [346171] = {item = 184502}, --侍神者的袖珍传送门：玛卓克萨斯
    [346173] = {item = 184501}, --侍神者的袖珍传送门：雷文德斯
    [346168] = {item = 184504}, --侍神者的袖珍传送门：奥利波斯
    [346167] = {item = 184500}, --侍神者的袖珍传送门：晋升堡垒
    [176766] = {item = 119183}, --风险召唤卷轴
    [193669] = {}, --空间漂移新手指南
    [225436] = {item = 141016}, --城镇传送卷轴：法罗纳尔
    [223805] = {}, --空间漂移能手指南
    [245173] = {item = 151016}, --开裂的死亡之颅
    [291981] = {item = 167075}, --超级安全传送器：麦卡贡
    [390783] = {item = 200613}, --艾拉格风石碎片
    [335671] = {item = 181163}, --传送卷轴：伤逝剧场
    [71436] = {item = 50287}, --海湾渔靴
    [82674] = {item = 64457}, --阿古斯的最后一件圣物
    [80256] = {item = 58487}, --深岩之洲药水
    [175604] = {}, --刀塔圣物
    [175608] = {}, --卡拉波圣物
    [140295] = {item = 95567}, --肯瑞托信标（联盟）
    [140300] = {item = 95568}, --夺日者信标（部落）

    --装备
    [54406] = {item = 44935}, --肯瑞托戒指
    [139432] = {item = 144392}, --搏击俱乐部戒指（部落）
    [139437] = {item = 144391}, --搏击俱乐部戒指（联盟）
    [196079] = {item = 169298}, --奥山徽章（部落）
    [196080] = {item = 169297}, --奥山徽章（联盟）
    [28148] = {item = 22589}, --埃提耶什，守护者的传说之杖
    [145430] = {}, --迷时神器（法术足够“风味”了，所以没加物品）
    [231054] = {item = 142469}, --魔导大师的紫罗兰印戒
    [376300] = {item = 193000}, --缚环沙漏
    [41234] = {item = 32757}, --卡拉波神圣勋章
    [89597] = {item = 63379}, --巴拉丁典狱官战袍（联盟）
    [89598] = {item = 63378}, --地狱咆哮近卫军战袍（部落）
    [1221356] = {item = 63353}, --协作披风（部落）
    [1221359] = {item = 63352}, --协作披风（联盟）
    [1221357] = {item = 63207}, --协和披风（部落）
    [1221360] = {item = 63206}, --协和披风（联盟）
    [89158] = {item = 65274}, --协同披风（部落）
    [89157] = {item = 65360}, --协同披风（联盟）
    [66238] = {item = 46874}, --银色北伐军战袍
    [289284] = {item = 166560}, --船长的指挥玺戒（联盟）
    [289283] = {item = 166559}, --指挥官的战斗玺戒（部落）

    --虫洞
    [23442] = {item = 18984}, --空间撕裂器 - 永望镇
    [23453] = {}, --安全传送器：加基森
    [36890] = {item = 30542}, --空间撕裂器 - 52区
    [36941] = {item = 30544}, --超级安全传送器：托什雷的基地
    [67833] = {}, --虫洞发生器：诺森德
    [126755] = {}, --虫洞发生器：潘达利亚
    [163830] = {}, --虫洞离心机
    [250796] = {}, --虫洞发生器：阿古斯
    [299083] = {}, --虫洞发生器：库尔提拉斯
    [299084] = {}, --虫洞发生器：赞达拉
    [324031] = {}, --虫洞发生器：暗影界
    [386379] = {}, --龙洞发生器：巨龙群岛
    [448126] = {}, --虫洞发生器：卡兹阿加

    --法师
    [446540] = {}, --传送：多恩诺嘉尔
    [395277] = {}, --传送：瓦德拉肯
    [344587] = {}, --传送：奥利波斯
    [120145] = {}, --远古传送：达拉然
    [32271] = {}, --传送：埃索达
    [3567] = {}, --传送：奥格瑞玛
    [3561] = {}, --传送：暴风城
    [53140] = {}, --传送：达拉然 - 诺森德
    [3565] = {}, --传送：达纳苏斯
    [3566] = {}, --传送：雷霆崖
    [49359] = {}, --传送：塞拉摩
    [35715] = {}, --传送：沙塔斯
    [33690] = {}, --传送：沙塔斯
    [49358] = {}, --传送：斯通纳德
    [3562] = {}, --传送：铁炉堡
    [88342] = {}, --传送：托尔巴拉德
    [88344] = {}, --传送：托尔巴拉德
    [32272] = {}, --传送：银月城
    [3563] = {}, --传送：幽暗城
    [281403] = {}, --传送：伯拉勒斯
    [224869] = {}, --传送：达拉然 - 破碎群岛
    [193759] = {}, --传送：守护者圣殿
    [176248] = {}, --传送：暴风之盾
    [281404] = {}, --传送：达萨罗
    [132627] = {}, --传送：锦绣谷
    [132621] = {}, --传送：锦绣谷
    [176242] = {}, --传送：战争之矛

    --德鲁伊
    [18960] = {}, --传送：月光林地
    [193753] = {}, --梦境行者
    [147420] = {item = 136849}, --自然道标

    --黑铁矮人
    [265225] = {}, --钻探机

    --11.2新版本及补充更新
    [26373] = {item = 21711}, --春节邀请函
    [46149] = {item = 35230}, --达纳里安的传送卷轴
    [63826] = {item = 45705}, --银色锦标赛邀请函
    [73324] = {item = 52251}, --吉安娜的吊坠
    [85609] = {item = 61379}, --吉德文的炉石
    [96333] = {item = 68808}, --英雄的炉石
    [96334] = {item = 68809}, --老兵的炉石
    [136252] = {item = 91866}, --埃索达传送门碎片
    [136253] = {item = 91863}, --银月城传送门碎片
    [136254] = {item = 91865}, --达纳苏斯传送门碎片
    [136255] = {item = 91864}, --铁炉堡传送门碎片
    [136256] = {item = 91862}, --幽暗城传送门碎片
    [136257] = {item = 91861}, --雷霆崖传送门碎片
    [136258] = {item = 91860}, --暴风城传送门碎片
    [136259] = {item = 91850}, --奥格瑞玛传送门碎片
    [151895] = {item = 107441}, --血槌炉渣矿井传送门
    [197104] = {item = 132119}, --奥格瑞玛传送石
    [197104] = {item = 147879}, --先知的指引石
    [197107] = {item = 132120}, --暴风城传送石
    [216138] = {item = 138448}, --马戈斯的徽记
    [220746] = {item = 139590}, --传送卷轴：拉文霍德
    [220989] = {item = 139599}, --肯瑞托强化指环
    [223352] = {item = 140319}, --卡德加的道标
    [223444] = {item = 140324}, --移动传送道标
    [225428] = {item = 141013}, --城镇传送卷轴：沙拉尼尔
    [225434] = {item = 141014}, --城镇传送卷轴：萨吉塔
    [225435] = {item = 141015}, --城镇传送卷轴：卡德拉尔
    [225440] = {item = 141017}, --城镇传送卷轴：利安特尔
    [239570] = {item = 146796}, --达拉然传送石
    [240913] = {item = 147354}, --光缚符石
    [244018] = {item = 147878}, --先知的指引石
    [267381] = {item = 159224}, --祖达萨炉石
    [267619] = {item = 159671}, --希利苏斯传送石
    [278512] = {item = 162515}, --午夜鲑鱼
    [308841] = {item = 172203}, --开裂的炉石
    [311643] = {item = 173373}, --法奥的炉石
    [311678] = {item = 173430}, --魔枢传送卷轴
    [311681] = {item = 173523}, --提瑞斯法营地卷轴
    [311703] = {item = 173526}, --凯尔达隆卷轴
    [311704] = {item = 173527}, --暮色森林卷轴
    [311705] = {item = 173528}, --鎏金炉石
    [311709] = {item = 173530}, --暮色森林卷轴
    [311711] = {item = 173531}, --诅咒之地卷轴
    [311712] = {item = 173532}, --艾尔文森林卷轴
    [311749] = {item = 173537}, --发光的炉石
    [311798] = {item = 173698}, --卡拉赞卷轴
    [311800] = {item = 173699}, --诅咒之地卷轴
    [311897] = {item = 173716}, --覆藓炉石
    [367891] = {item = 189827}, --赛财团的入团证明
    [368788] = {item = 191029}, --莉莉安的炉石
    [395792] = {item = 201957}, --萨尔的炉石
    [406714] = {item = 204802}, --传送卷轴：兹斯克拉宝库
    [418549] = {item = 208206}, --传送水晶
    [450410] = {item = 223988}, --达拉然炉石
    [460271] = {item = 227669}, --传送卷轴
    [1234526] = {item = 243056}, --地下堡行者的法缚以太之门
}

TeleportAnnouncer.teleportItems = {}
function TeleportAnnouncer:buildTeleportItems()
    table.wipe(TeleportAnnouncer.teleportItems)
    for inventorySlotID = INVSLOT_FIRST_EQUIPPED, INVSLOT_LAST_EQUIPPED do
        local itemID = GetInventoryItemID("player", inventorySlotID)
        if itemID then
            local item = Item:CreateFromItemID(itemID)
            item:ContinueOnItemLoad(function()
                local _, spellID = C_Item.GetItemSpell(itemID)
                if spellID then
                    TeleportAnnouncer.teleportItems[spellID] = GetInventoryItemLink("player", inventorySlotID)
                end
            end)
        end
    end
end

